app/views/samples/_form.html.erb

SELECT "equipment".* FROM "equipment"
---
							<%#form.select :sample_type, [ ['Muestreo Simple', 'Simple'], ['Doble Sampleo', 'Doble'] ], {}, {id: "muestreo"} %>
							<%= form.collection_select(:equipment_id, Equipment.all, :id, :equipment_type, {}, {id: "equipment-select"} ) %>

SELECT "auditors".* FROM "auditors"
---
  						<div class="col-sm-4">
							<%= form.collection_select(:auditor_id, Auditor.all, :id, :name, {}, {id: "auditor-select"}) %>