app/views/auditors/show.html.erb

SELECT COUNT(*) FROM "pieces" WHERE "pieces"."sample_id" = ?  [["sample_id", 1]]
---
						  					   <td><%= sample.equipment.equipment_type %></td>
											   <td>Total: <%= sample.pieces.count %></td>

SELECT "samples".* FROM "samples" WHERE "samples"."auditor_id" = ?  [["auditor_id", 1]]
---
	 <ul>
        <% @auditor.samples.each do |sample| %>