app/controllers/auditor_controller.rb

SELECT "auditors".* FROM "auditors"
---
  def index
    @auditors = Auditor.all

SELECT  "auditors".* FROM "auditors" WHERE "auditors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
      def set_auditor
        @auditor = Auditor.find(params[:id])