app/controllers/auditors_controller.rb

  def index
    @auditors = Auditor.all
---
SELECT  "auditors".* FROM "auditors" ORDER BY "auditors"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def show
    @auditor = Auditor.find(params[:id])
    @auditor_samples = @auditor.samples.limit(10)
---
SELECT  "auditors".* FROM "auditors" WHERE "auditors"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "samples".* FROM "samples" WHERE "samples"."auditor_id" = ? LIMIT ?  [["auditor_id", 1], ["LIMIT", 10]]

  def create
    @auditor = Auditor.new(auditor_params)

    respond_to do |format|
      if @auditor.save
---
INSERT INTO "auditors" ("name", "employee", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "armandillo"], ["employee", "2"], ["created_at", "2018-04-16 15:28:17.161431"], ["updated_at", "2018-04-16 15:28:17.161431"]]

  def update
      respond_to do |format|
        if @auditor.update(auditor_params)
---
UPDATE "auditors" SET "name" = ?, "employee" = ?, "updated_at" = ? WHERE "auditors"."id" = ?  [["name", "mongol"], ["employee", "mongoloide"], ["updated_at", "2018-04-16 16:51:49.764044"], ["id", 2]]

  def destroy
    @auditor.destroy
---
DELETE FROM "auditors" WHERE "auditors"."id" = ?  [["id", 2]]

    def set_auditor
      @auditor = Auditor.find(params[:id])
---
SELECT  "auditors".* FROM "auditors" WHERE "auditors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]