app/controllers/samples_controller.rb

  def index
    @samples = Sample.all.order(sampledate: :desc)
---
SELECT "samples".* FROM "samples" ORDER BY "samples"."sampledate" DESC

  def create
    @sample = Sample.new(sample_params)

    respond_to do |format|
      if @sample.save
---
INSERT INTO "samples" ("sample_type", "aql", "lot", "equipment_id", "auditor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["sample_type", "testeo"], ["aql", 2.0], ["lot", "234"], ["equipment_id", 1], ["auditor_id", 1], ["created_at", "2018-04-16 20:48:39.570521"], ["updated_at", "2018-04-16 20:48:39.570521"]]

  def update
    respond_to do |format|
      if @sample.update(sample_params)
---
UPDATE "samples" SET "aql" = ?, "lot" = ?, "equipment_id" = ?, "auditor_id" = ?, "updated_at" = ? WHERE "samples"."id" = ?  [["aql", 123.0], ["lot", "12"], ["equipment_id", 2], ["auditor_id", 6], ["updated_at", "2018-04-21 04:53:11.888265"], ["id", 9]]

  def destroy
    @sample.destroy
---
DELETE FROM "samples" WHERE "samples"."id" = ?  [["id", 5]]

    def set_sample
      @sample = Sample.find(params[:id])
---
SELECT  "samples".* FROM "samples" WHERE "samples"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]