app/controllers/samples_controller.rb

  def index
    @samples = Sample.all
---
SELECT "samples".* FROM "samples"